In [338]:
# Note: this file created per Module 4.4.3: load and Read CSV Files.
# https://courses.bootcampspot.com/courses/1225/pages/4-dot-4-3-load-and-read-csv-files?module_item_id=497361

# Add the Pandas dependency.
import pandas as pd

In [339]:
#In the next cell, declare two variables: 
# one assigned to the schools_complete.csv file and one assigned to the students_complete.csv file. 
# (These files are located in the Resources folder.) 

# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [340]:
# ^^^ Cell above: When we want to get the indirect path to a file, 
# we use os.path.join() 
# to load a file from somewhere in our directory.

# If you decide to use this approach, you will need to import the os module with your Pandas dependency using the following code: 

# Add the dependencies.
# import pandas as pd
# import os

# Then, use the os.path.join() method to connect to the CSV files: 

# Files to load
# school_data_to_load = os.path.join("Resources", "schools_complete.csv")
# student_data_to_load = os.path.join("Resources", "students_complete.csv")

In [341]:
# Read the School Data File
# Now we'll read each CSV file with the Pandas function read_csv(). 
# Inside this function, we'll add the file we want to read, 
# which is one of many parameters that we can add to this function.

# Next step (below):

# The code below  to a new cell and run the cell 
# will allow us to read schools_complete.csv and store it in a DataFrame.

# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [342]:
# Read the Student Data File
# Now we'll read the student data file and store it in a Pandas DataFrame by adding the following code to a new cell:

# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [343]:
# Per Module 4.4.4: Commit Your Code: Save PySchools.ipynb to
# School_District_Analysis folder (make sure the Resources folder containing
# the CSV files is also in the School_District_Analysis folder).

# Instructions on how to commit code in Module 4.4.4 (refer to the module).
# https://courses.bootcampspot.com/courses/1225/pages/4-dot-4-4-commit-your-code?module_item_id=497366

In [344]:
# Module 4.5.1: Find Missing Values.
# The count() Method
# With the count() method, we can get a count of the rows for each column containing data. By default, "null" values are not counted, so you can often quickly identify which columns have missing data.

# Let's use the count() method on the school_data_df DataFrame. Add the following code to a new cell and run the cell:

# Determine if there are any missing values in the school data.
# (Cell below): school_data_df.count()

In [345]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [346]:
# ^^^ (Cell above: no missing values.)
# Do the same with student_complete.csv (below)

In [347]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [348]:
# ^^^ (Cell above: no missing values.)

In [349]:
# The isnull() Method (applied to the cell below):
# The Pandas library also has the isnull() method for determining empty rows. When you apply the isnull() method to a column, Series, or a DataFrame, a Boolean value will be returned, either "True" for the row or rows that are empty, i.e., null, or "False" for the rows that are not empty.

# Let's use the isnull() method on the school_data_df DataFrame.

# Determine if there are any missing values in the school data.
# school_data_df.isnull()
# When we execute this code, we see that every row that is not empty is given the Boolean value "False," which tells us that there are no missing values.

In [350]:
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [351]:
# Determine if there are any missing values in the student data.
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [352]:
# To get the total number of empty rows, or rows that are "True," we can use the Pandas sum() method after the isnull() method, like this:

# Determine if there are any missing values in the student data.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [353]:
# ^^^ (Cell above): This output allows us to more easily determine at a glance how many rows are empty in the student_data_df DataFrame (zero). This is more straightforward than output that shows "False" in thousands of rows.

In [354]:
#The notnull() Method
#Another method that we can use to find missing values is the notnull() method. When you apply the notnull() method to a column, Series, or a DataFrame, a Boolean will be returned: "True" for the row or rows that are not empty, or "False" for the row or rows that are empty. This method returns the opposite output of the isnull() method.

# Determine if there are not any missing values in the school data.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [355]:
# ^^^ (Cell above): When we run this code, the output returns a copy of our school_data_df DataFrame, where all the rows that do not have any missing values are labeled "True." See the following image.

In [356]:
#Like we did with the student_data_df DataFrame, we can chain the notnull() method and the sum() method to get the sum of all the columns that are "True."

# Determine if there are not any missing values in the student data.
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [357]:
# ^^^ (Cell above): When we execute this code, we get the number of rows that are not null, which is 39,170 for each column.

In [358]:
# Module 4.5.3: Determine Data Types

# Data type: Boolean; Pandas name: bool; example: "True and False"
# Data type: Object; Pandas name: O, object; example: Typically strings; often used as a catchall for columns with different data types or other Python objects like tuples, lists, and dictionaries
# # Data type: datetime; Pandas name: datetime64; example: Specific moment in time with nanosecond precision, i.e., 2019-06-03 16:04:00.465107

# If integers store values from –32,768 to 32,767, they are 16 bits or int16.
# If integer store values from –2,147,483,648 to 2,147,483,647, they are 32 bits or int32.
# If integer store values from–9,223,372,036,854,775,808 to 9,223,372,036,854,775,807, they are 64 bits, or int64. 

# With the Pandas library, we can check the data types of each column by using the Pandas dtypes attribute on a DataFrame.

# To determine the data types in school_data.csv, type and run the following code (refer to cell below):

In [359]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [360]:
school_data_df["budget"].dtype

dtype('int64')

In [361]:
# Module 4.5.7 (Fix the Students' Names): CODE NOT WORKING

# Add each prefix and suffix to remove to a list.
# CODE WORKS: prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
# CODE DOES NOT WORK: for word in prefixes_suffixes:
# CODE DOES NOT WORK: student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

# file was commited onto GitHub (with this cell of code commented out; commented out for future reference)

# Module 4.6.1: instructions to download clean_students_complete.csv and save into Resources folder

# Continued onto module 4.7.1 below:

In [362]:
# Module 4.7.1 (Merge DataFrames):

# To merge two DataFrames, there must be a column in each of the DataFrames with the same name. So before we merge, let's review the column names in each DataFrame.

# The columns in school_data_df are:
# School ID
# school_name
# type
# size
# budget

# The columns in the student_data_df are:
# Student ID
# student_name
# gender
# grade
# school_name
# reading_score
# math_score

# We'll merge school_data_df and student_data_dfon a shared column using the merge() method. The column that these DataFrames have in common is school_name. Inside the parentheses of the merge() method, we'll do the following:

# Add the DataFrames to be merged.
# Add the shared column to each DataFrame so that the merge can occur.
# Define how the DataFrames should be merged: left, right, inner, or outer. The default is inner. (You will learn more about merging later in this course.)

In [363]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

# Let's break down how the DataFrames are being merged with this code.

# We create a new DataFrame for the merged DataFrames, called school_data_complete_df.
# The new DataFrame is created as a result of merging DataFrame #2 (school_data_df), which is the "right" DataFrame, into DataFrame #1 (student_data_df), which is the "left" DataFrame. We refer to the DataFrames as "left" and "right" to reflect the order they appear inside the parentheses.
# We use the parameter "on," which is equal to a list of the columns that are identical from each DataFrame, in this case, "school_name." We can also use the column name like this: on="school_name".

# There may be cases in which you want to merge on a column that has similar information in two separate DataFrames, but is named differently in each—for example, "school_name" in one DataFrame and "high_school" in the second. In these cases, you should rename the columns so that they match. This will help avoid duplicate columns or merging issues.

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [364]:
# ^^^ (Cell above): The data from student_data_df takes up the first seven columns, and the four columns from the school_data_df are added at the end: School ID, type, size, and budget.

# Now that we have our merged DataFrame, we can start getting some of the school district's key metrics.

In [365]:
# Module 4.7.2: Get the Number of Students

# If we add the count() method to the school_data_complete_df DataFrame, we will count all the items in each row for each column that is not null.

# Get the total number of students.
# student_count = school_data_complete_df.count()
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [366]:
# In the output, we see that each column has 39,170 rows, or values. 
# Therefore, we can choose any one of the columns
# and get the student count using the following format: school_data_complete_df[column].count()--comment out 'student_count = school_data_complete_df.count()' in the previous cell.

In [367]:
# Module 4.7.3: Get the Number of Schools
    
# There are two ways we can get the number of schools. 
# One is to use the school_data_df DataFrame and assign a variable to one of the columns in the DataFrame, like this:

# Calculate the total number of schools.
school_count = school_data_df["school_name"].count()
school_count

15

In [368]:
# ^^^ (Cell above): After running the code, the output is 15.

# We can't use the count() method on the school_data_complete_df["school_name"] column because this would give us a value of 39,170. If we want to use school_data_complete_df, we first need to get the unique items in the ["school_name"] column by using the unique() method. This method will return a "ndarray", or n-dimensional array of all the unique values of that column.

# Add the following code to a new cell and run the cell. The output is shown below.

In [369]:
# Calculate the total number of schools
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [370]:
len(school_data_complete_df["school_name"].unique())

15

In [371]:
# Module 4.7.4: Get the Total Budget
    
# Calculate the total budget.
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [372]:
# Module 4.7.5: Get the Score Averages

# Calculate the average reading score.
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [373]:
# Calculate the average math score.
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [374]:
# Module 4.7.6: Get the Passing Percentages

# To get the percentage of students who passed math and reading, we will write code to:

# Determine the passing grade.
# Get the number of students who passed math and reading in separate DataFrames.
# Calculate the number of students who passed math and reading.
# Calculate the percentage of students who passed math and reading.
# To get the overall passing percentage, we will write code to:

# Get the number of students who passed both math and reading in a DataFrame.
# Calculate the number of students who passed both math and reading.
# Calculate the percentage of students who passed both math and reading.

In [375]:
# Determine the Passing Grade
# For math and reading assessment tests in this school district, the passing score was 70. Therefore, we need to get all the math and reading scores that are greater than or equal to 70. To do this, in a new cell, assign a passing_math variable to the math_score column in school_data_complete_df, where all the math scores are equal to or greater than 70.

passing_math = school_data_complete_df["math_score"] >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70

In [376]:
# To find the passing_math variable, run passing_math in a new cell (below). 
# The result is Boolean values for the rows, where "True" means the score is 
# equal to or greater than 70, and "False" means the score is not equal to or greater than 70.

# When we execute the code for passing_reading, we will get Boolean values for each row, 
# where "True" means the score is equal to or greater than 70, and "False" means the score is not equal to or greater than 70.

In [377]:
# Get the Number of Students Who Passed Math and Reading
# To get all the students who passed math and all the students 
# who passed reading, we need to filter our school_data_complete_df DataFrame for the "True" cases. 
# In other words, get only the students who have a grade is equal or greater to 70.

# Get all the students who are passing math in a new DataFrame.
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [378]:
passing_math["student_name"].count()

29370

In [379]:
# Now we can repurpose the code we wrote to calculate passing_math in order to find passing_reading, 
# but we'll switch out math_score with reading_score, as shown in the following code:

# Get all the students that are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]

# To get the number of students who passed math and reading, apply the count() method to the student_name column of the passing_math and passing_reading DataFrames, like this:

# Calculate the number of students passing math.
passing_math_count = passing_math["student_name"].count()

# Calculate the number of students passing reading.
passing_reading_count = passing_reading["student_name"].count()

In [380]:
print(passing_math_count)
print(passing_reading_count)

29370
33610

In [381]:
# Get the Percentage of Students Who Passed Math and Reading
# To get the percentage of students who passed math and reading, 
# divide the passing_math_count and the passing_reading_count by the total number of students, 
# and then multiply by 100.

# Since we are calculating a percentage, we need to convert the student_count to a number with a decimal, or floating-point decimal, by using float().

# The final calculation should look like this:

# Calculate the percent that passed math.
passing_math_percentage = passing_math_count / float(student_count) * 100

# Calculate the percent that passed reading.
passing_reading_percentage = passing_reading_count / float(student_count) * 100

In [382]:
# When we execute this cell and print out the passing_math_percentage and passing_reading_percentage, 
# we get the percentage of students who passed math and the percentage of students who passed reading:
print(passing_math_percentage)
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

In [383]:
# Calculate the Overall Passing Percentage
# To get the overall passing percentage, we need to get all the students who passed both math and reading and divide by the total number of students.

# We can filter the school_data_complete_df DataFrame by adding the school_data_complete_df["math_score"] >= 70 and school_data_complete_df["reading_score"] >= 70 with the logical operator "&" within brackets, like this:

# When we run this cell (below), the output will be a new DataFrame with all the columns that contain students who passed both math and reading.

# Calculate the students who passed both math and reading.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [384]:
passing_math_reading["student_name"].count() # Option 1 of getting total number of students that passed math AND reading

25528

In [385]:
passing_math_reading.student_name.count() # Option 2 of getting total number of students that passsed math AND reading

25528

In [386]:
# Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [387]:
# Finally, we calculate the percentage of students who passed both math and reading by dividing the total number of students and multiplying by 100, using the following code.

# Calculate the overall passing percentage.
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983

In [388]:
# This completes the data we need for the district summary. Now we'll add it to a new DataFrame.

In [389]:
# Module 4.7.7: Create a District Summary DataFrame

# Now that we have performed all the calculations needed for the district summary, let's add the following values and columns to a new DataFrame named district_summary_df.

# Total number of schools in the column "Total Schools"
# Total number of students in the column "Total Students"
# Total budget in the column "Total Budget"
# Average reading score in the column "Average Reading Score"
# Average math score in the column "Average Math Score"
# Percentage of students passing reading in the column "% Passing Reading"
# Percentage of students passing math in the column "% Passing Math"
# Overall passing percentage in the column "% Overall Passing"

# REWIND: Remember, one way to create a new DataFrame is to convert a list of dictionaries to a DataFrame.

In [390]:
# To create district_summary_df DataFrame, we can create a list of dictionaries, where the keys are column names and the values are the metrics we calculated. We do this because the DataFrame has no index, and lists have natural indexing.

# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame(
          [{"Total Schools": school_count,
          "Total Students": student_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percentage,
         "% Passing Reading": passing_reading_percentage,
        "% Overall Passing": overall_passing_percentage}])
district_summary_df

# Per Module 4.7.8: place this code below the district_summary_df DataFrame

# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Students"]

# # Format the columns.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [391]:
# Module 4.7.8: Format Columns

# To clean up the district_summary_df DataFrame, we will format dollar amounts to two decimal places, and format the grade averages to one decimal place and percentages to the nearest whole number percent.

# This type of formatting can be done with the built-in Pandas map() function. The map() function is used for substituting each value in a Series with another value. Where the new value is generated from a function, a dictionary, or a Series.

# In this module, as well as future modules, we'll be using and writing functions. So before we use the map() function for formatting, let's gain a better understanding of how functions work.

In [392]:
# Define the function "say_hello" so it prints "Hello!" when called.
def say_hello():
    print("Hello!")
    

    
# Let's go over what is happening in this function.

# The def keyword, which is short for "define," and is used to create the function.
# The function name, say_hello(), is always written after def.
# There is a colon after the function name, which tells Python that a code block or statement will follow. This is similar to conditional and repetition statements. All code within the function should be indented.
# The indented statement that follows is print("Hello!").

In [393]:
# Calling a Function

# Now we'll practice calling a function. Create a new Jupyter Notebook file and name it function.ipynb. Copy the following code for the say_hello() function into the file.

# When you run the code (above), nothing appears to happen because we don't see an output error. To get the function to print "Hello!" in the output cell, we have to call the function.

# To call the say_hello() function, type say_hello() in a new cell and run the cell.

# Call the function.
say_hello()

Hello!

In [394]:
# Another example of calling a function:

# Define teh function "say_something" so it prints whatever is passed as the variable when called.
def say_something(something):\
    print(something)

In [395]:
# Call the function
say_something("Hello World")

Hello World

In [396]:
Jane_says = "Hi, my name is Jane. I'm learning Python!"
say_something(Jane_says)

Hi, my name is Jane. I'm learning Python!

In [397]:
# ---End of example (above) ---

In [398]:
# Writing Functions for the School District Data
# We've reviewed some basics about functions. Now how do we apply functions to our data analysis? For example, consider if you were in charge of calculating passing percentages for not just the school district we've been focusing on, but many school districts. It wouldn't be efficient to perform the steps of the calculation for each school district. A better method would be to create functions for this calculation and pass variables into the function.

# Let's say you need to write a function to get the percentage of students who passed math when we know the number of students that passed math, pass_math_count, and the total number of students for a school district, student_count. We can define this function as passing_math_percentand pass the two values inside the function. Here's what this might look like:

# Define a function that calculates the percentage of students that passed both 
# math and reading and returns the passing percentage when the function is called.

def passing_math_percent(pass_math_count, student_count):
    return pass_math_count / float(student_count) * 100

# Let's go over what is happening in this function.

# We added two values to the passing_math_percent function: pass_math_count and student_count.
# We added return in front of the calculation for the passing percentage.
# The return statement has a unique purpose. It causes the function to end and literally "returns" what is in front of the statement back to the caller, which is the function. Let's run through an example of what happens to better illustrate the process.

In [399]:
# In a new cell, assign the passing_math_count and the total_student_count variables 29,730 and 39,170, respectively. When we run this cell, that nothing will happen until we call the function.

passing_math_count = 29370
total_student_count = 39170

In [400]:
# Now we can call the function in a new cell with the two values, like this:

# IMPORTANT: If you don't add the number of parameters that are assigned to the function when calling the function, you'll get a TypeError:. This means that you need to add one or more of the parameters when calling the function.

# Call the function.
passing_math_percent(passing_math_count, total_student_count)

74.9808526933878

In [401]:
# ---More examples of functions inside functions.ipynb file (Module 4.7.8)---

In [402]:
# We can format the dollar amounts in the district_summary_df columns to two decimal places with a U.S. dollar sign, and numbers larger than 999 with a thousands separator.
# Let's apply this formatting technique to format the Total Students column with a thousands separator using the basic syntax:
# df["column"] = df["column"].map("{:,}".format)
# Now let's replace df["column"] with district_summary_df["Total Students"], so our code looks like the following. Add this code to youPyCitySchools.ipynb file below the output of your district_summary_df DataFrame, and run the cell.

In [403]:
# One benefit of using the format() function is that we can add other format specifications, like a U.S. dollar sign or other characters. For example, we will format the Total Budget column in the district_summary_df DataFrame with a U.S. dollar sign, and then format the numbers with a thousands separator and to two decimal places using the following syntax: "${:,.2f}".format.

In [404]:
# Per Module 4.7.8: add the following code to a new cell in our PyCitySchools.ipynb file and run the cell.

# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [405]:
# We need to format the remaining columns accordingly:

# The "Average Reading Score" column will be formatted to one decimal place.
# The "Average Math Score" column will be formatted to one decimal place.
# The "% Passing Reading" column will be formatted to the nearest whole number percentage.
# The "% Passing Math" column will be formatted to the nearest whole number percentage
# The "% Overall Passing" column will be formatted to the nearest whole number percentage.

In [406]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [407]:
# Module 4.7.9: Reorder Columns

# If the order of your columns in the district summary DataFrame is not in top-down order, you need to reorder them. If the columns are already in this order, you can use this time to gain familiarity with how to reorder columns in case the need arises. 

# The order of the columns in the district_summary_df DataFrame should be as follows:

# Total Schools
# Total Students
# Total Budget
# Average Math Score
# Average Reading Score
# % Passing Math
# % Passing Reading
# % Overall Passing

In [408]:
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]
# You can change the order of the columns or delete any from the line of code above.

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [409]:
# Determine the school type.
per_school_types = school_data_df.set_index(["school_name"])["type"]
per_school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [410]:
# Add the per_school_types into a DataFrame for testing.
df = pd.DataFrame(per_school_types)
df

                           type
school_name
Huang High School      District
Figueroa High School   District
Shelton High School     Charter
Hernandez High School  District
Griffin High School     Charter
Wilson High School      Charter
Cabrera High School     Charter
Bailey High School     District
Holden High School      Charter
Pena High School        Charter
Wright High School      Charter
Rodriguez High School  District
Johnson High School    District
Ford High School       District
Thomas High School      Charter

In [411]:
# Calculate the total student count.
per_school_counts = school_data_df["size"]
per_school_counts

0     2917
1     2949
2     1761
3     4635
4     1468
5     2283
6     1858
7     4976
8      427
9      962
10    1800
11    3999
12    4761
13    2739
14    1635
Name: size, dtype: int64

In [412]:
# Calculate the total student count.
per_school_counts = school_data_df.set_index(["school_name"])["size"]
per_school_counts

school_name
Huang High School        2917
Figueroa High School     2949
Shelton High School      1761
Hernandez High School    4635
Griffin High School      1468
Wilson High School       2283
Cabrera High School      1858
Bailey High School       4976
Holden High School        427
Pena High School          962
Wright High School       1800
Rodriguez High School    3999
Johnson High School      4761
Ford High School         2739
Thomas High School       1635
Name: size, dtype: int64

In [413]:
# Calculate the total student count.
per_school_counts = school_data_complete_df["school_name"].value_counts()
per_school_counts

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [414]:
# Module 4.8.3: Get the budget Per Student

# Calculate the total school budget.
per_school_budget = school_data_df.set_index(["school_name"])["budget"]
per_school_budget

school_name
Huang High School        1910635
Figueroa High School     1884411
Shelton High School      1056600
Hernandez High School    3022020
Griffin High School       917500
Wilson High School       1319574
Cabrera High School      1081356
Bailey High School       3124928
Holden High School        248087
Pena High School          585858
Wright High School       1049400
Rodriguez High School    2547363
Johnson High School      3094650
Ford High School         1763916
Thomas High School       1043130
Name: budget, dtype: int64

In [415]:
# The data type for the budget column is int64, which is suitable for calculations that we need to perform in order to find the budget per student.

# To get the budget per student, we'll divide the per_school_budget by the per_school_counts.

# Add the following code to a new cell and run the cell.

# Calculate the per capita spending.
per_school_capita = per_school_budget / per_school_counts
per_school_capita

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [416]:
# Module 4.8.4: Get the Score Averages Per School

# We've used the set_index() method on the school_name column in student_data_df to get data from another column, just like how we retrieved the school budget using school_data_df.set_index(["school_name"])["budget"].

# Let's use this procedure to replace budget with math_score. Add the following code to a new cell and run the cell (below):

# Calculate the math scores.
student_school_math = student_data_df.set_index(["school_name"])["math_score"]
student_school_math

school_name
Huang High School     79
Huang High School     61
Huang High School     60
Huang High School     58
Huang High School     84
                      ..
Thomas High School    90
Thomas High School    70
Thomas High School    84
Thomas High School    90
Thomas High School    75
Name: math_score, Length: 39170, dtype: int64

In [417]:
# ^^^ (Cell above): Unfortunately, we can't use the school_data_df DataFrame, as there aren't any columns containing grades. We also can't use the set_index() method on the school_name column in student_data_df because there are too many occurrences of the school_name column.

# Instead, we need to use the Pandas groupby() function. The groupby() function will split an object (like a DataFrame), apply a mathematical operation, and combine the results. This can be used to group large amounts of data when we want to compute mathematical operations on these groups.

# The mathematical operation we will apply to the groupby() function is the mean() method. Let's see how this will look when we apply it to school_data_complete_df to get the grade averages for each column. Add the following code (below):

# Calculate the average math scores.

# Calculate the average math scores.
per_school_averages = school_data_complete_df.groupby(["school_name"]).mean()
per_school_averages

,Student ID,reading_score,math_score,School ID,size,budget
school_name,,,,,,
Bailey High School,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0
Cabrera High School,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0
Figueroa High School,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0
Ford High School,36165.0,80.746258,77.102592,13.0,2739.0,1763916.0
Griffin High School,12995.5,83.816757,83.351499,4.0,1468.0,917500.0
Hernandez High School,9944.0,80.934412,77.289752,3.0,4635.0,3022020.0
Holden High School,23060.0,83.814988,83.803279,8.0,427.0,248087.0
Huang High School,1458.0,81.182722,76.629414,0.0,2917.0,1910635.0
Johnson High School,32415.0,80.966394,77.072464,12.0,4761.0,3094650.0
Pena High School,23754.5,84.044699,83.839917,9.0,962.0,585858.0
Rodriguez High School,28035.0,80.744686,76.842711,11.0,3999.0,2547363.0
Shelton High School,6746.0,83.725724,83.359455,2.0,1761.0,1056600.0
Thomas High School,38352.0,83.848930,83.418349,14.0,1635.0,1043130.0
Wilson High School,14871.0,83.989488,83.274201,5.0,2283.0,1319574.0
Wright High School,25135.5,83.955000,83.682222,10.0,1800.0,1049400.0

In [418]:
# But we don't want all of this data in the school summary DataFrame, just the reading and math scores. To get the average math score and reading score for each school, we can add the math_score and reading_score columns at the end. Add the following code to a new cell and run the cell (below):

# Calculate the average test scores.
per_school_math = school_data_complete_df.groupby(["school_name"]).mean()["math_score"]

per_school_reading = school_data_complete_df.groupby(["school_name"]).mean()["reading_score"]

In [419]:
per_school_math

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [420]:
per_school_reading

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [421]:
# Module 4.8.5: Get the Passing Percentages Per School

# Pseudocode:

# To get the passing percentages, we need to:
# 1. Determine what is the passing grade.
# 2. Get the number of students who passed math and reading.
# 3. Get the students who passed math and passed reading
    
# We determined the number of students who passed math and reading for the district summary using the following code:

# REWIND:
# passing_math = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)]

# and

# passing_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)]

# So variables don't get reassigned, we'll use the same code but assign each calculation to new variables that reflect the students who passed math or reading for each school.

# Add the following code to a new cell and run the cell.

In [422]:
# Calculate the passing scores by creating a filtered DataFrame.
per_school_passing_math = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)]

per_school_passing_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)]

In [423]:
per_school_passing_math

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [424]:
per_school_passing_reading

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [425]:
# To create a Series that has school_name as the index, we'll use groupby(["school_name"]) 
# on the per_school_passing_math and the per_school_passing_math DataFrames.

# REWIND: Using the groupby() function will split an object (like a DataFrame) and apply a mathematical operation.

# Next, we need to perform a mathematical operation on the groupby() object. Remember, we need to get the number of students who passed, so we'll use the count() method on the student_name column. Add the following code to a new cell and run the cell.

In [426]:
# # Calculate the number of students passing math and passing reading by school.
per_school_passing_math = per_school_passing_math.groupby(["school_name"]).count()["student_name"]

per_school_passing_reading = per_school_passing_reading.groupby(["school_name"]).count()["student_name"]

In [427]:
per_school_passing_math

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
Name: student_name, dtype: int64

In [428]:
per_school_passing_reading

school_name
Bailey High School       4077
Cabrera High School      1803
Figueroa High School     2381
Ford High School         2172
Griffin High School      1426
Hernandez High School    3748
Holden High School        411
Huang High School        2372
Johnson High School      3867
Pena High School          923
Rodriguez High School    3208
Shelton High School      1688
Thomas High School       1591
Wilson High School       2204
Wright High School       1739
Name: student_name, dtype: int64

In [429]:
# Determine the Percentage of Students Passing Math and Reading

# To determine the percentage of students passing math and reading, 
# we must divide per_school_passing_math and per_school_passing_reading by the per_school_counts, 
# and then multiply by 100, as shown in the following code:

# Calculate the percentage of passing math and reading scores per school.
per_school_passing_math = per_school_passing_math / per_school_counts * 100

per_school_passing_reading = per_school_passing_reading / per_school_counts * 100

In [430]:
per_school_passing_math

Bailey High School       66.680064
Cabrera High School      94.133477
Figueroa High School     65.988471
Ford High School         68.309602
Griffin High School      93.392371
Hernandez High School    66.752967
Holden High School       92.505855
Huang High School        65.683922
Johnson High School      66.057551
Pena High School         94.594595
Rodriguez High School    66.366592
Shelton High School      93.867121
Thomas High School       93.272171
Wilson High School       93.867718
Wright High School       93.333333
dtype: float64

In [431]:
per_school_passing_reading

Bailey High School       81.933280
Cabrera High School      97.039828
Figueroa High School     80.739234
Ford High School         79.299014
Griffin High School      97.138965
Hernandez High School    80.862999
Holden High School       96.252927
Huang High School        81.316421
Johnson High School      81.222432
Pena High School         95.945946
Rodriguez High School    80.220055
Shelton High School      95.854628
Thomas High School       97.308869
Wilson High School       96.539641
Wright High School       96.611111
dtype: float64

In [432]:
# Get the Overall Passing Percentage for All Students for Each School

# To get the overall passing percentage, we need to get all the students who passed both math and reading and then divide by the total number of students.

# # Calculate the students who passed both math and reading.
per_passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]

per_passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [433]:
# Next, we'll get the total number of students from each school 
# who passed both math and reading. To do this, we need to set the index 
# as school_name, and then we need to get the number of students.

# To get the total number of students who passed both math and reading on the per_passing_math_reading DataFrame, we use the following code, which sets the index to school_name, and then use the count() method for the student_name.

# Calculate the number of students who passed both math and reading.
per_passing_math_reading = per_passing_math_reading.groupby(["school_name"]).count()["student_name"]

In [434]:
# Module 4.8.5: Get the Percentages per School
# Finally, we calculate the percentage of students who passed math and reading by dividing the 
# total number of students and multiplying by 100, using the following code.

# Calculate the overall passing percentage.
per_overall_passing_percentage = per_passing_math_reading / per_school_counts * 100

In [435]:
per_overall_passing_percentage

Bailey High School       54.642283
Cabrera High School      91.334769
Figueroa High School     53.204476
Ford High School         54.289887
Griffin High School      90.599455
Hernandez High School    53.527508
Holden High School       89.227166
Huang High School        53.513884
Johnson High School      53.539172
Pena High School         90.540541
Rodriguez High School    52.988247
Shelton High School      89.892107
Thomas High School       90.948012
Wilson High School       90.582567
Wright High School       90.333333
dtype: float64

In [436]:
# DataFrame completed--onto Module 4.8.6: Create the School Summary Dataframe

# Adding a list of values with keys to create a new DataFrame.

per_school_summary_df = pd.DataFrame({
             "School Type": per_school_types,
             "Total Students": per_school_counts,
             "Total School Budget": per_school_budget,
             "Per Student Budget": per_school_capita,
             "Average Math Score": per_school_math,
           "Average Reading Score": per_school_reading,
           "% Passing Math": per_school_passing_math,
           "% Passing Reading": per_school_passing_reading,
           "% Overall Passing": per_overall_passing_percentage})
per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [437]:
# ^^^ (Cell above): The columns are in the correct order, but we still need to apply formatting to the Total School Budget and Per Student Budget columns, 
# as well as apply a thousands separator to the Total Students column. Let's clean up this DataFrame!

In [438]:
# Module 4.8.7: Clean up the DataFrame

# In the per_school_summary_df DataFrame, we will format the Total School Budget and Per Student Budget columns to include:#

# A U.S. dollar sign 
# Two decimal places
# A thousands separator

# Format Columns
# REWIND: To format every row in the column, use the map() function. Inside the parentheses, apply formatting with {" "}.format. Inside the quotations, pass the formatting specification to the value in the row.

# Format the Total School Budget and the Per Student Budget columns.
per_school_summary_df["Total School Budget"] = per_school_summary_df["Total School Budget"].map("${:,.2f}".format)

per_school_summary_df["Per Student Budget"] = per_school_summary_df["Per Student Budget"].map("${:,.2f}".format)


# Display the data frame
per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455

In [439]:
# Reorder Columns

# REWIND: To reorder columns, use the following format:

# new_column_order = ["column2", "column4", "column1"]

# Assign the same DataFrame to the new column order:

# df = df[new_column_order]



# If the columns were not ordered correctly, put them in the following orde#r:

# School Type
# Total Students
# Total School Budget
# Per Student Budget
# Average Math Score
# Average Reading Score
# % Passing Math
# % Passing Reading
# % Overall Passing

# Reorder the columns in the order you want them to appear.
new_column_order = ["School Type", "Total Students", "Total School Budget", "Per Student Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
per_school_summary_df = per_school_summary_df[new_column_order]

per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455

In [440]:
# Module 4.9.1: Find the Highest Performing Schools

# To display the top five highest-performing schools, we can sort the per_school_summary_df DataFrame on the % Overall Passing column.

#REWIND:
# To view the first five rows of a DataFrame, use the df.head() method.
# To view the last five rows of a DataFrame, use the df.tail() method.

# Using the Pandas sort_values() function, we can sort a DataFrame or Series for a given text, index, or column that is passed within the parentheses. In addition, we can add the parameter ascending=False to sort from highest to lowest, or ascending=True to sort from lowest to highest the value referenced in the sort_values() function. If we don't add the ascending parameter, the default is ascending=True.

# To sort the schools on the % Overall Passing column from highest to lowest, add the following code:

# Sort and show top five schools.
top_schools = per_school_summary_df.sort_values(["% Overall Passing"], ascending=False)

top_schools.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,90.948012
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,90.582567
Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,90.540541

In [441]:
# ^^^ (Cell above): When we execute the code, we are going to sort the per_school_summary_df DataFrame on the % Overall Passing column from the highest % Overall Passing to the lowest.

In [442]:
# To sort for the five lowest-performing schools 
# based on the % Overall Passing, add the following code:

# Sort and show top five schools.
bottom_schools = per_school_summary_df.sort_values(["% Overall Passing"], ascending=True)

bottom_schools.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,52.988247
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,53.513884
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,53.527508
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,53.539172

In [443]:
# Module 4.9.3: Object Oriented Programming

class Cat: # Keyword class is ued to create a class
    def __init__(self, name): # __init__ is a special method called a "class constructor" that Python calls every time a new instance of the class is created.
                              # this method takes 2 arguments: [self] and [name]
                              # self--refers to a specific Cat object that is created when the method is called;
                              # name--the 2nd argument, name, will be specified each time a new Cat object is created.
        self.name = name
        
first_cat = Cat('Felix')
print(first_cat.name)

second_cat = Cat('Garfield')
print(second_cat.name)

Felix
Garfield

In [444]:
# In OOP, an object can have attributes, such as name in the example above. It can also perform actions through functions. Let's now create a Dog class.

# This class contains three attributes: name, color, and sound. 
# It also contains a method, or a function that is associated with an object. 
# This means that an object created from this Dog class can now perform an action through the bark method. 

class Dog:
    def __init__(self, name, color, sound):
        self.name = name
        self.color = color
        self.sound = sound

    def bark(self):
        return self.sound + ' ' + self.sound

# Let;s instantiate an object.

first_dog = Dog('Fido', 'brown', 'woof!')
print(first_dog.name)
print(first_dog.color)
first_dog.bark()

Fido
brown

'woof! woof!'

In [445]:
second_dog = Dog('Lady', 'blonde', 'arf!')
print(second_dog.name)
print(second_dog.color)
second_dog.bark()

Lady
blonde

'arf! arf!'

In [446]:
# Reminder: that if you wanted to preview a Pandas DataFrame called df, you would call its head method.

# df.head()

# The dot notation used here should be a clue that the Pandas uses object-oriented programming to create an object called df, which represents a DataFrame, and that this object has a method called head, which returns the first five rows of data. You will see many more examples of such objects, their attributes, and their methods in the rest of the course.

In [447]:
# Module 4.10.1: Create Grade-Level DataFrames

# In this DataFrame, each grade—9th, 10th, 11th and 12th—is a Series of data. To get each grade as a Series, we need to filter school_data_complete_df for each grade.
# REWIND: To get the passing scores for the district and school summary, we used the following code:
# passing_math = school_data_complete_df["math_score"] >= 70
# When we executed this code, a Series was returned where rows with a score equal to or greater than 70 were "True," and rows with scores not equal to or greater than 70 were "False."
# We can use this same principle to get the grade level for each school in the school_data_complete_df DataFrame.

# Let's first get the ninth graders in a Series. Set the variable ninth_graders equal to school_data_complete_df["grade"] == "9th". This will retrieve all rows where this statement is "True."
# Using the code school_data_complete_df["grade"] == "9th", we can filter school_data_complete_df for the "True" cases as follows:
# school_data_complete_df[(school_data_complete_df["grade"] == "9th")]
# Now repurpose this code for each grade by replacing "9th" with each grade. Assign a grade-level variable to each grade-level DataFrame; for example, ninth_graders is for the ninth grade data.

# Create a grade level DataFrames.
ninth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "9th")]

tenth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "10th")]

eleventh_graders = school_data_complete_df[(school_data_complete_df["grade"] == "11th")]

twelfth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "12th")]

ninth_graders.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
12,12,Brittney Walker,F,9th,Huang High School,64,79,0,District,2917,1910635
13,13,William Long,M,9th,Huang High School,71,79,0,District,2917,1910635

In [448]:
# Now that we have the data for each grade level, we need to get the grade averages for each school.

# Module 4.10.2: Score Averages Grouped by School Name

# To get the average math and reading scores for each grade level and for each school, we need to do the following: 

# Use the groupby function to group by the school_name column
# Calculate the mean math_score and reading_score

# REWIND: When we use the groupby() function on a DataFrame, we need to perform a mathematical operation on the groupby() object by selecting a column from the DataFrame.

In [449]:
# Get the Average Math Scores by School
# First, we will get the average math score for each school. For each grade level DataFrame, we will use the groupby() function on the school_name column and apply the mean() on the math_score column.

# To get the math_score averages for each grade level, add the following code:



# Group each grade level DataFrame by the school name for the average math score.
ninth_grade_math_scores = ninth_graders.groupby(["school_name"]).mean()["math_score"]

tenth_grade_math_scores = tenth_graders.groupby(["school_name"]).mean()["math_score"]

eleventh_grade_math_scores = eleventh_graders.groupby(["school_name"]).mean()["math_score"]

twelfth_grade_math_scores = twelfth_graders.groupby(["school_name"]).mean()["math_score"]

In [450]:
# When we print out the first five rows for the ninth_grade_math_scores, the Series will look like the following image; the index is the school name, and the first column is the average math scores for ninth graders.

ninth_grade_math_scores

school_name
Bailey High School       77.083676
Cabrera High School      83.094697
Figueroa High School     76.403037
Ford High School         77.361345
Griffin High School      82.044010
Hernandez High School    77.438495
Holden High School       83.787402
Huang High School        77.027251
Johnson High School      77.187857
Pena High School         83.625455
Rodriguez High School    76.859966
Shelton High School      83.420755
Thomas High School       83.590022
Wilson High School       83.085578
Wright High School       83.264706
Name: math_score, dtype: float64

In [451]:
# Get the Average Reading Scores by School
# We can repurpose this code to find the average reading scores for each grade level by replacing  math_score with reading_score. Add the following code:



# Group each grade level DataFrame by the school name for the average reading score.
ninth_grade_reading_scores = ninth_graders.groupby(["school_name"]).mean()["reading_score"]

tenth_grade_reading_scores = tenth_graders.groupby(["school_name"]).mean()["reading_score"]

eleventh_grade_reading_scores = eleventh_graders.groupby(["school_name"]).mean()["reading_score"]

twelfth_grade_reading_scores = twelfth_graders.groupby(["school_name"]).mean()["reading_score"]

In [452]:
ninth_grade_reading_scores

school_name
Bailey High School       81.303155
Cabrera High School      83.676136
Figueroa High School     81.198598
Ford High School         80.632653
Griffin High School      83.369193
Hernandez High School    80.866860
Holden High School       83.677165
Huang High School        81.290284
Johnson High School      81.260714
Pena High School         83.807273
Rodriguez High School    80.993127
Shelton High School      84.122642
Thomas High School       83.728850
Wilson High School       83.939778
Wright High School       83.833333
Name: reading_score, dtype: float64

In [453]:
# Now that we have this information, we need to generate a report showing the average math and reading scores by grade level. Let's add all of the data to a DataFrame!

# Module 4.10.3: Comebine Each Grade Level Series into a DataFrame

# District officials and other key stakeholders are eager to see the report on average math and reading scores by grade level. Maria would like you to combine the average math scores for each grade and the average reading scores for each grade and add them to separate DataFrames.

# Combine each grade level Series for average math scores by school into a single DataFrame.
math_scores_by_grade = pd.DataFrame({
               "9th": ninth_grade_math_scores,
               "10th": tenth_grade_math_scores,
               "11th": eleventh_grade_math_scores,
               "12th": twelfth_grade_math_scores})

math_scores_by_grade.head()

                            9th       10th       11th       12th
school_name
Bailey High School    77.083676  76.996772  77.515588  76.492218
Cabrera High School   83.094697  83.154506  82.765560  83.277487
Figueroa High School  76.403037  76.539974  76.884344  77.151369
Ford High School      77.361345  77.672316  76.918058  76.179963
Griffin High School   82.044010  84.229064  83.842105  83.356164

In [454]:
# We'll use the same format to add the reading scores for each grade level to a new DataFrame.

# Combine each grade level Series for average reading scores by school into a single DataFrame.
reading_scores_by_grade = pd.DataFrame({
              "9th": ninth_grade_reading_scores,
              "10th": tenth_grade_reading_scores,
              "11th": eleventh_grade_reading_scores,
              "12th": twelfth_grade_reading_scores})

reading_scores_by_grade.head()

                            9th       10th       11th       12th
school_name
Bailey High School    81.303155  80.907183  80.945643  80.912451
Cabrera High School   83.676136  84.253219  83.788382  84.287958
Figueroa High School  81.198598  81.408912  80.640339  81.384863
Ford High School      80.632653  81.262712  80.403642  80.662338
Griffin High School   83.369193  83.706897  84.288089  84.013699

In [455]:
# ^^^ (Cells above): Average math and reading DataFrames created/completed.

In [456]:
# Module 4.10.4: Format the Averages and Remove the Index Name

# For reporting purposes, we'll format the grade-level averages to one decimal place, as well as remove the name of the index column, school_name.

# REWIND: To format every row in a column, use the map() function. Inside the parentheses, apply the formatting using "{ }".format.
# To format float64 data types to one decimal place, add {:.1f} inside the quotations, like this: map("{:.1f}".format.



# To format the reading and math averages for each grade level we'll use map("{:.1f}".format. And we'll remove the index, school_name, by setting the index name to "None" with the following syntax: index.name = None.
# Let's apply these methods to the math_scores_by_grade DataFrame first. Add the following code: 

# Format each grade column.
math_scores_by_grade["9th"] = math_scores_by_grade["9th"].map("{:.1f}".format)
math_scores_by_grade["10th"] = math_scores_by_grade["10th"].map("{:.1f}".format)
math_scores_by_grade["11th"] = math_scores_by_grade["11th"].map("{:.1f}".format)
math_scores_by_grade["12th"] = math_scores_by_grade["12th"].map("{:.1f}".format)

# Make sure the columns are in the correct order.
math_scores_by_grade = math_scores_by_grade[["9th", "10th", "11th", "12th"]]

# Remove the index name.
math_scores_by_grade.index.name = None
# Display the DataFrame.
math_scores_by_grade.head()

                       9th  10th  11th  12th
Bailey High School    77.1  77.0  77.5  76.5
Cabrera High School   83.1  83.2  82.8  83.3
Figueroa High School  76.4  76.5  76.9  77.2
Ford High School      77.4  77.7  76.9  76.2
Griffin High School   82.0  84.2  83.8  83.4

In [457]:
# Now apply the same formatting method and remove the index name for the reading_scores_by_grade DataFrame.

# Format each grade column.
reading_scores_by_grade["9th"] = reading_scores_by_grade["9th"].map("{:.1f}".format)
reading_scores_by_grade["10th"] = reading_scores_by_grade["10th"].map("{:.1f}".format)
reading_scores_by_grade["11th"] = reading_scores_by_grade["11th"].map("{:.1f}".format)
reading_scores_by_grade["12th"] = reading_scores_by_grade["12th"].map("{:.1f}".format)

# Make sure the columns are in the correct order.
reading_scores_by_grade = reading_scores_by_grade[["9th", "10th", "11th", "12th"]]

# Remove the index name.
reading_scores_by_grade.index.name = None
# Display the DataFrame.
reading_scores_by_grade.head()

                       9th  10th  11th  12th
Bailey High School    81.3  80.9  80.9  80.9
Cabrera High School   83.7  84.3  83.8  84.3
Figueroa High School  81.2  81.4  80.6  81.4
Ford High School      80.6  81.3  80.4  80.7
Griffin High School   83.4  83.7  84.3  84.0

In [458]:
# Module 4.11.1: Establish the Spending Ranges Per Student

# For this analysis, we will need to sort the school spending per student into four spending "bins," or ranges. The four bins will be dollar amounts that range from the lowest amount ($578) to the highest amount ($655) a school spends on a student.
# REWIND: We determined the budget per student in the school summary when we retrieved the per_school_capita Series: 
per_school_capita

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [459]:
# We will need to arbitrarily determine the spending ranges in order to group the schools fairly. Each bin must include the average math and reading scores, the percentage passing math and reading, and the overall passing percentage for the spending bins, not for the schools.

# To create this DataFrame, we need to do the following:

# Group the schools into four bins, or ranges, based on the budget per student.
# For each spending range, get the following data:
# Average math and reading scores
# The percentage of students passing math and reading
# The overall passing percentage, which is the average of the percentage of students passing math and reading

# Before we aggregate the school spending per student into four bins, we must establish the spending ranges. We can determine the spending ranges by using the per_school_capita Series that was used to get the budget per student.

In [460]:
# Get the Spending Ranges:


# Before we create the bins, we need to determine the distribution of spending per student. We can find the distribution for school spending per student by using the describe() method.

# When we apply the describe() method to a DataFrame or Series, it will return the following descriptive statistics for the DataFrame or Series:

# The number of rows in the DataFrame or Series as count
# The average of the rows as mean
# The standard deviation of the rows as std
# The minimum value of the rows as min
# The 25th percentile as 25%
# The 50th percentile as 50%
# The 75th percentile as 75%
# The minimum value of the rows as max
# Using the describe() method will help us determine the spending bins we should use, based on the descriptive statistics. To get the descriptive statistics on the per_school_capita, add the following code to a new cell:

In [461]:
# Get the descriptive statistics for the per_school_capita.
per_school_capita.describe()

count     15.000000
mean     620.066667
std       28.544368
min      578.000000
25%      591.500000
50%      628.000000
75%      641.500000
max      655.000000
dtype: float64

In [462]:
# As you can see, the minimum is 578 and the maximum is 655. The standard deviation is 28.5, or approximately 30. We don't want the lowest bin to be $578 because there is only one school at or below $578, which is Wilson High School. However, there are four schools that spend less than $585 per student, so $585 will be our lowest bin. Also, because the standard deviation is about 30, we will increase the bins by $30, up to $675. Therefore, the four bins will be: $585, $615, $645, and $675.

# The bins will define a range of spending. For the $585 bin, the range is all values at or below $585, the range for the $615 bin is $586–615, and so on.



# Each bin has a lower "edge" and an upper "edge" value. By default, bins are inclusive up to the right edge, so schools that spend $0–585 will be placed in the first bin. Schools that spend $586–615 will be placed in the second bin, and so on.

# In Pandas, we can write the ranges for the bins as follows: spending_bins = [0, 585, 615, 645, 675].

# Let's go over why these spending bins have five numbers instead of four, which is the number of bins we want. When Pandas creates the lower edge, it needs a value lower than the lowest value in the column of the per_school_capita Series, which happens to be 578. In our DataFrame, we make the lower edge equal to 0. If we don't include the 0 for the spending bins, the lowest bin becomes $586–615, which means that the schools that spend less than $586 are not considered. First we'll use the correct spending bins for our ranges, and then we'll leave out the 0 to see how that affects the bins.

# Let's address one more item before moving on. If you look at the spending_bins list, you'll notice that the dollar sign ($) isn't included with the ranges. This is because the numbers in the  per_school_capita Series are the float64 data type, so adding a dollar sign would cause an error.

# Now let's take a look at how to use the spending bins.

In [463]:
# Group the Series on the Spending Ranges



# To group the spending ranges, we use the Pandas cut() function. The cut() function segments and sorts data values into bins. We'll use the cut() function to create our spending bins.

# To apply the cut() function to a DataFrame or Series, we use pd.cut(df, ranges). This creates a new DataFrame or Series on the given ranges.

# We can "cut" the per_school_capita into the spending_ranges using the following code.

# Cut the per_school_capita into the spending ranges.
# The output shows that each school has a range for the spending per student instead of a specific amount.
spending_bins = [0, 585, 615, 645, 675]
pd.cut(per_school_capita, spending_bins)

Bailey High School       (615, 645]
Cabrera High School        (0, 585]
Figueroa High School     (615, 645]
Ford High School         (615, 645]
Griffin High School      (615, 645]
Hernandez High School    (645, 675]
Holden High School         (0, 585]
Huang High School        (645, 675]
Johnson High School      (645, 675]
Pena High School         (585, 615]
Rodriguez High School    (615, 645]
Shelton High School      (585, 615]
Thomas High School       (615, 645]
Wilson High School         (0, 585]
Wright High School         (0, 585]
dtype: category
Categories (4, interval[int64, right]): [(0, 585] < (585, 615] < (615, 645] < (645, 675]]

In [464]:
# ^^^ (Cell above): The cut() function places each value of the per_school_capita Series into one of four bins. The bins are created by a list of five numbers given as the spending_bins that define the edges.

# What happens if we don't add 0 as the lower edge for the first bin?

# Cut the per_school_capita into the spending ranges.
spending_bins = [585, 615, 645, 675]
pd.cut(per_school_capita, spending_bins)

Bailey High School       (615.0, 645.0]
Cabrera High School                 NaN
Figueroa High School     (615.0, 645.0]
Ford High School         (615.0, 645.0]
Griffin High School      (615.0, 645.0]
Hernandez High School    (645.0, 675.0]
Holden High School                  NaN
Huang High School        (645.0, 675.0]
Johnson High School      (645.0, 675.0]
Pena High School         (585.0, 615.0]
Rodriguez High School    (615.0, 645.0]
Shelton High School      (585.0, 615.0]
Thomas High School       (615.0, 645.0]
Wilson High School                  NaN
Wright High School                  NaN
dtype: category
Categories (3, interval[int64, right]): [(585, 615] < (615, 645] < (645, 675]]

In [465]:
# ^^^ (Cell above): The output shows that four high schools—Cabrera, Holden, Wilson, and Wright—are not in a bin and therefore would not be in the final DataFrame.

In [466]:
# Next, we'll determine how many schools are in each range by grouping the spending bins as the index using the groupby() function on the per_school_capita Series. Remember that we need to perform a mathematical operation when we use the groupby() function.

# To find out how many schools are in those bins, use the count() method on the groupby() function. Edit your previous code so that it looks like the following: 

# Cut the per_school_capita into the spending ranges.
spending_bins = [0, 585, 615, 645, 675]
per_school_capita.groupby(pd.cut(per_school_capita, spending_bins)).count()

(0, 585]      4
(585, 615]    2
(615, 645]    6
(645, 675]    3
dtype: int64

In [467]:
# Looking at this output, it seems that we didn't group the schools fairly. We need to adjust our ranges so that we have three or four schools in each range. Let's increase the [585, 615] range to [585, 630] and change the third range to [630, 645]. The spending_bins will look like this: 

# [0, 585, 630, 645, 675]


 
# Edit your previous code and run the cell again. The code should look like this: 

# Cut the per_school_capita into the spending ranges.
spending_bins = [0, 585, 630, 645, 675]
per_school_capita.groupby(pd.cut(per_school_capita, spending_bins)).count()

(0, 585]      4
(585, 630]    4
(630, 645]    4
(645, 675]    3
dtype: int64

In [468]:
# ^^^ (Cell above): These ranges look better! 

# Now let's name each range. We can label the ranges using a list of string values. Add the following code to a new cell and run the cell.

In [469]:
# Establish the spending bins and group names.
spending_bins = [0, 585, 630, 645, 675]
group_names = ["<$586", "$586-630", "$631-645", "$646-675"]

# Now that we have our correct spending bins and group names, we can "cut" the per_school_capita Series to get the four spending bins and add them to the per_school_summary_df DataFrame.

In [470]:
# Module 4.11.2: Categorize the Spending Bins

# Using our spending bins and ranges, we can create a new column in the per_school_summary_df DataFrame which will be assigned the spending bins from the per_school_capita Series.



# To do this, we will need to do the following:

# Use the cut() function on the per_school_capita Series.
# Add the bin data to a new column in the per_school_summary_df DataFrame.
#Add the following code to a new cell and run the cell.

# Categorize spending based on the bins.

# There's a lot going on in this code, so let's break it down.

# To the left of the equals sign, we add a new column called "Spending Ranges (Per Student)" to the per_school_summary_df DataFrame. This column will contain the values specified by using the cut() function.
# Inside the cut() function, we add the data (per_school_capita) we are going to use for "Spending Ranges (Per Student)". The data must be a one-dimensional array, like a list or the per_school_capitaSeries.
# Inside the parentheses, we add the spending_bins and the labels for the bins using labels=group_names.

per_school_summary_df["Spending Ranges (Per Student)"] = pd.cut(per_school_capita, spending_bins, labels=group_names)
per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Ranges (Per Student)
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283,$586-630
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769,<$586
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476,$631-645
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887,$631-645
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455,$586-630

In [471]:
# ^^^ (Cell above): The "Spending Ranges (Per Student)" column is added as the last column. Whenever a new column is added to a DataFrame, it becomes the last column. This is because each column in the DataFrame is like an item in a list.

# REWIND: When we add a new item to a list, that item will always be added at the end of the list unless we specify a list index where it should be placed.

# Now we need to filter the per_school_summary_df DataFrame in order to get the average scores as well as the percentage of students who passed reading and math for each range in the spending_bins.

In [472]:
# Module 4.11.3: Group by the Spending Ranges

# The final DataFrame will contain the average math and reading scores, the percentage of students who passed math and reading, and the overall percentage of students who passed for each spending bin. To get these averages and percentages, we'll use the groupby() function to group the data on the spending bins in the index column, "Spending Ranges (Per Student)." 

# First, let's create four new Series with the following data:

# Average Math Score
# Average Reading Score
# Average % Passing Math
# Average % Passing Reading
# Average % Overall Passing
# REWIND: To create a Series that has a column as the index, use the groupby() function on the DataFrame and add the column inside the parentheses.
# We'll create each Series using the groupby() function on the "Spending Ranges (Per Student)" column. For each Series, we'll use the mean() method to get the averages of the Average Math Score column, Average Reading Score column, % Passing Math column, and % Passing Reading column. For the average "% Overall Passing," we'll add the "% Passing Math" and "% Passing Reading" columns and then divide by 2.

# Calculate averages for the desired columns.
spending_math_scores = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["Average Math Score"]

spending_reading_scores = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["Average Reading Score"]

spending_passing_math = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Passing Math"]

spending_passing_reading = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Passing Reading"]

overall_passing_spending = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Overall Passing"]

In [473]:
overall_passing_spending

Spending Ranges (Per Student)
<$586       90.369459
$586-630    81.418596
$631-645    62.857656
$646-675    53.526855
Name: % Overall Passing, dtype: float64

In [474]:
# Module 4.11.4: Create a DataFrame for the Scores by School Spending

# Now that we have the average math and reading scores, the average percentage of students who passed math and reading, and the average overall percentage as a Series, let's add this data to a new DataFrame.
# REWIND: To add a list or Series to a DataFrame, use the following format:
# df = pd.DataFrame({"column name": column values})



# Create the Spending Summary DataFrame
# Assemble into DataFrame.
spending_summary_df = pd.DataFrame({
          "Average Math Score" : spending_math_scores,
          "Average Reading Score": spending_reading_scores,
          "% Passing Math": spending_passing_math,
          "% Passing Reading": spending_passing_reading,
          "% Overall Passing": overall_passing_spending})

spending_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Ranges (Per Student),,,,,
<$586,83.455399,83.933814,93.460096,96.610877,90.369459
$586-630,81.899826,83.155286,87.133538,92.718205,81.418596
$631-645,78.518855,81.624473,73.484209,84.391793,62.857656
$646-675,76.997210,81.027843,66.164813,81.133951,53.526855

In [475]:
# ^^^ (Cell above):  we need to get our DataFrame to adhere to grade-reporting standards by following certain formatting.  We need to apply the following changes:

# Format the average math and reading scores to one decimal place
# Format the percent passing math and reading to the nearest whole number
# Format the overall passing percentage to the nearest whole number

# Formatting
spending_summary_df["Average Math Score"] = spending_summary_df["Average Math Score"].map("{:.1f}".format)

spending_summary_df["Average Reading Score"] = spending_summary_df["Average Reading Score"].map("{:.1f}".format)

spending_summary_df["% Passing Math"] = spending_summary_df["% Passing Math"].map("{:.0f}".format)

spending_summary_df["% Passing Reading"] = spending_summary_df["% Passing Reading"].map("{:.0f}".format)

spending_summary_df["% Overall Passing"] = spending_summary_df["% Overall Passing"].map("{:.0f}".format)

spending_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Ranges (Per Student),,,,,
<$586,83.5,83.9,93,97,90
$586-630,81.9,83.2,87,93,81
$631-645,78.5,81.6,73,84,63
$646-675,77.0,81.0,66,81,54

In [476]:
# Module 4.12.1: Create Bins for School Size

# Previously, we grouped the scores by school spending per student. Now we'll group the scores by school size. For this DataFrame we'll create three bins: small, medium, and large. To determine these bins, we can look at the per_school_counts, or total students, from each school from the per_school_summary_df DataFrame.

# REWIND: 
# We retrieved the per_school_counts using the following code:
# per_school_counts = school_data_complete_df("school_name").value_counts()

per_school_counts

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [477]:
# Looking at the per_school_counts Series, we can see that the highest student population is 4,976. Therefore, the upper edge will be 5,000. Because we have only three bins—small, medium, and large—here's how we can group the school sizes:

# "Small" schools have fewer than 1,000 students
# "Medium" schools have 1,000–1,999 students
# "Large" schools have 2,000–5,000 students
# In the new DataFrame, calculate the average math and reading scores, math and reading passing percentages, and overall passing percentage for each bin.

# To establish the bins and group names, add the following code to a new cell and run the cell. Remember, bins are inclusive up to the right edge, so the bin range for "small" schools is 0–999, the bin range for "medium" schools is 1000–1999, and the bin range for "large" schools is 2000–5000.

# Establish the bins.
size_bins = [0, 999, 1999, 5000]
group_names = ["Small (<1000)", "Medium (1000-1999)", "Large (2000-5000)"]

In [478]:
# Now we can "cut" the per_school_summary_df DataFrame using the cut function to get the three sizing bins.

In [479]:
# Module 4.12.2: Categorize the Size Bins

# Getting the school size bins was a lot easier than getting the spending bins. Now you have enough time left in the day to group the school sizes in the per_school_summary_df DataFrame based on the bins.



# Using our school size bins, we can create a new column in the per_school_summary_df DataFrame, which will be assigned the school size bins from the per_school_summary_df DataFrame.

# To do this, we will need to do the following:

# Use the cut() function on the per_school_summary_df DataFrame.
# Add the bin data to a new column in the per_school_summary_df DataFrame.
# Let's go over what is happening in this code.
# We added the new column "School Size," which becomes the last column in the DataFrame.

We added a new column to per_school_summary_df DataFrame, called "School Size".
We used the cut() function on the per_school_summary_df DataFrame column "Total Students" and grouped the student size in the size_bins, and then added the labels=group_names.

# Categorize spending based on the bins.
per_school_summary_df["School Size"] = pd.cut(per_school_summary_df["Total Students"], size_bins, labels=group_names)

per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Ranges (Per Student),School Size
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283,$586-630,Large (2000-5000)
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769,<$586,Medium (1000-1999)
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476,$631-645,Large (2000-5000)
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887,$631-645,Large (2000-5000)
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455,$586-630,Medium (1000-1999)

In [481]:
# Module 4.12.3: Group by School Size 

# The final DataFrame will contain the average math and reading scores, the percentage of students who passed math and reading, and the overall percentage of students who passed for each school-size bin. Just as we did when we created the DataFrame for school spending per student, we'll use the groupby() function to group the data on the size bins in the index column, School Size.

# First, let's create four new Series. We need to get the following data:
# Average Math Score
# Average Reading Score
# Average % Passing Math
# Average % Passing Reading
# Average % Overall Passing

# Create each Series using the groupby() function on the School Size column. The data for each column will be calculated by using the mean() method to get the averages of the following columns: Average Math Score, Average Reading Score, % Passing Math, and % Passing Reading. For the average "% Overall Passing," we'll add the % Passing Math and  % Passing Reading columns, and then divide by 2.

# Calculate averages for the desired columns.
size_math_scores = per_school_summary_df.groupby(["School Size"]).mean()["Average Math Score"]

size_reading_scores = per_school_summary_df.groupby(["School Size"]).mean()["Average Reading Score"]

size_passing_math = per_school_summary_df.groupby(["School Size"]).mean()["% Passing Math"]

size_passing_reading = per_school_summary_df.groupby(["School Size"]).mean()["% Passing Reading"]

size_overall_passing = per_school_summary_df.groupby(["School Size"]).mean()["% Overall Passing"]

In [ ]:
# ^^^ (Cell above): Now we can add these average into a new DataFrame.

In [482]:
# Module 4.12.4: Create a DataFrame for the Scores by School Size

# Just like we did with the school spending data, we are going to add the average math and reading scores, the average percentage of students who passed math and reading, and the average overall percentage to a new DataFrame.


# Create the Size Summary DataFrame
# Assemble into DataFrame.
size_summary_df = pd.DataFrame({
          "Average Math Score" : size_math_scores,
          "Average Reading Score": size_reading_scores,
          "% Passing Math": size_passing_math,
          "% Passing Reading": size_passing_reading,
          "% Overall Passing": size_overall_passing})

size_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,89.883853
Medium (1000-1999),83.374684,83.864438,93.599695,96.790680,90.621535
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,58.286003

In [483]:
# ^^^ (Cell above): Now we need to apply the proper formatting to ensure the DataFrame adheres to grade-reporting standards. We need to do the following: 

# Format the average math and reading scores to one decimal place 
# Format the percentage of students passing math and reading to the nearest whole number 
# Format the overall passing percentage to the nearest whole number 
# To do this, we can repurpose some code from the spending_summary_df DataFrame.



# Formatting.
size_summary_df["Average Math Score"] = size_summary_df["Average Math Score"].map("{:.1f}".format)

size_summary_df["Average Reading Score"] = size_summary_df["Average Reading Score"].map("{:.1f}".format)

size_summary_df["% Passing Math"] = size_summary_df["% Passing Math"].map("{:.0f}".format)

size_summary_df["% Passing Reading"] = size_summary_df["% Passing Reading"].map("{:.0f}".format)

size_summary_df["% Overall Passing"] = size_summary_df["% Overall Passing"].map("{:.0f}".format)

size_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
Small (<1000),83.8,83.9,94,96,90
Medium (1000-1999),83.4,83.9,94,97,91
Large (2000-5000),77.7,81.3,70,83,58

In [484]:
# Module 4.13.1: Group by School Type

# For this final DataFrame, we'll group the scores by the type of school: district or charter. For each type of school, we'll calculate the average math and reading scores, math and reading passing percentages, and overall passing percentage for each bin.

# Since the School Type column is in the per_school_summary_df DataFrame, we won't need to create this column as we did for the school spending and school size DataFrames. All we need to do is use the groupby() function to group the data on the School Type.

# However, we will need to create four new Series, as we did for the two previous DataFrames by getting the following data:
# Average Math Score
# Average Reading Score
# Average % Passing Math
# Average % Passing Reading
# Average % Overall Passing

# Calculate averages for the desired columns.
type_math_scores = per_school_summary_df.groupby(["School Type"]).mean()["Average Math Score"]

type_reading_scores = per_school_summary_df.groupby(["School Type"]).mean()["Average Reading Score"]

type_passing_math = per_school_summary_df.groupby(["School Type"]).mean()["% Passing Math"]

type_passing_reading = per_school_summary_df.groupby(["School Type"]).mean()["% Passing Reading"]

type_overall_passing = per_school_summary_df.groupby(["School Type"]).mean()["% Overall Passing"]

In [ ]:
# ^^^ (Cell above): now we can add all the averages to generate the final DataFrame.

In [485]:
# Module 4.13.2: Create a DataFrame for the Scores by School Type

# We're going to create a new DataFrame called type_summary_df that includes average math and reading scores, the average percentage of students who passed math and reading, and the average overall percentage.

# # Assemble into DataFrame.
type_summary_df = pd.DataFrame({
          "Average Math Score" : type_math_scores,
          "Average Reading Score": type_reading_scores,
          "% Passing Math": type_passing_math,
          "% Passing Reading": type_passing_reading,
          "% Overall Passing": type_overall_passing})

type_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,90.432244
District,76.956733,80.966636,66.548453,80.799062,53.672208

In [486]:
# ^^^ (Cell above): We're almost done! Like the previous DataFrames, this new DataFrame needs to adhere to grade-reporting standards. Therefore, we'll make the following formatting changes:

# Format the average math and reading scores to one decimal place
# Format the percentage of students passing math and reading to the nearest whole number 
# Format the overall passing percentage to the nearest whole number 



# Format the DataFrame
# Formatting
type_summary_df["Average Math Score"] = type_summary_df["Average Math Score"].map("{:.1f}".format)

type_summary_df["Average Reading Score"] = type_summary_df["Average Reading Score"].map("{:.1f}".format)

type_summary_df["% Passing Math"] = type_summary_df["% Passing Math"].map("{:.0f}".format)

type_summary_df["% Passing Reading"] = type_summary_df["% Passing Reading"].map("{:.0f}".format)

type_summary_df["% Overall Passing"] = type_summary_df["% Overall Passing"].map("{:.0f}".format)

type_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.5,83.9,94,97,90
District,77.0,81.0,67,81,54

In [ ]:
# ---END OF ALL OF MODULE 4---